[
  {
    "title": "Opinion",
    "link": "https://www.msn.com/en-us/money/other/4-big-ways-tech-could-go-backward-in-2025/ar-AA1C42I9?ocid=BingNewsVerp",
    "summary": "Opinion 10d on MSN Opinion 4 big ways tech could go backward in 2025 Intel’s Kaby Lake Core i7-7700X launched just a couple of months before AMD’s first-generation Ryzen CPUs, sporting a 4-core, ..."
  },
  {
    "title": "MediaNama",
    "link": "/news/search?q=site%3awww.medianama.com&FORM=NWBCLM",
    "summary": "MediaNama 10d When it comes to tech, we are going to see a very strong national security filter, says S. Jaishankar On tech talent: “And I think big tech recognises ... day is looking at trusted talent and technology controls. We’re going to get increasingly into these conversations with the US, Europe ..."
  },
  {
    "title": "moneycontrol.com",
    "link": "/news/search?q=site%3awww.moneycontrol.com&FORM=NWBCLM",
    "summary": "moneycontrol.com 29d Tech startups going for IPO should have 8-quarter rolling plan: Mohandas Pai Everybody has to face reality. We live in the real world. Are you expecting all the tech IPOs which are in the pipeline to go through this year? Many of them will make it through, because many of ..."
  },
  {
    "title": "Business Insider",
    "link": "/news/search?q=site%3awww.businessinsider.com&FORM=NWBCLM",
    "summary": "Business Insider 23d Tech employees are getting the message: Playtime's over Microsoft was once referred to as the tech industry's \"country club,\" meaning a place employees would go after they were done working hard in their careers and wanted to coast before retirement."
  },
  {
    "title": "techxplore",
    "link": "/news/search?q=site%3atechxplore.com&FORM=NWBCLM",
    "summary": "techxplore 29d Tech stocks keep tumbling this year; here's why \"Investors don't know what's going to happen around the corner,\" said Dan Ives, a Wedbush Securities analyst who covers the technology sector. \"It's been an unsettling time, and that's why, after a ..."
  },
  {
    "title": "4 big ways tech could go backward in 2025",
    "link": "https://www.msn.com/en-us/money/other/4-big-ways-tech-could-go-backward-in-2025/ar-AA1C42I9?ocid=BingNewsVerp",
    "summary": "10d on MSN Opinion 4 big ways tech could go backward in 2025"
  },
  {
    "title": "MediaNama",
    "link": "/news/search?q=site%3awww.medianama.com&FORM=NWBCLM",
    "summary": "MediaNama 10d When it comes to tech, we are going to see a very strong national security filter, says S. Jaishankar"
  },
  {
    "title": "moneycontrol.com",
    "link": "/news/search?q=site%3awww.moneycontrol.com&FORM=NWBCLM",
    "summary": "moneycontrol.com 29d Tech startups going for IPO should have 8-quarter rolling plan: Mohandas Pai"
  },
  {
    "title": "Business Insider",
    "link": "/news/search?q=site%3awww.businessinsider.com&FORM=NWBCLM",
    "summary": "Business Insider 23d Tech employees are getting the message: Playtime's over"
  },
  {
    "title": "techxplore",
    "link": "/news/search?q=site%3atechxplore.com&FORM=NWBCLM",
    "summary": "techxplore 29d Tech stocks keep tumbling this year; here's why"
  }
]