[
  {
    "title": "Opinion",
    "link": "https://seekingalpha.com/article/4773804-the-us-vs-china-trade-war-intensifies-what-this-means-for-spy-qqq-and-tlt",
    "summary": "Opinion 3d Opinion The U.S. Vs. China Trade War Intensifies: What This Means For SPY, QQQ, And TLT The intensifying U.S.-China trade war, driven by reciprocal tariffs, threatens SPDR® S&P 500 ETF Trust and Invesco QQQ Trust ..."
  },
  {
    "title": "Nasdaq",
    "link": "/news/search?q=site%3awww.nasdaq.com&FORM=NWBCLM",
    "summary": "Nasdaq 10d QQQ March 2026 Options Begin Trading Investors in Invesco QQQ Trust (Symbol: QQQ) saw new options begin trading today, for the March 2026 expiration. One of the key inputs that goes into the price an option buyer is willing to pay ..."
  },
  {
    "title": "Seeking Alpha",
    "link": "/news/search?q=site%3aseekingalpha.com&FORM=NWBCLM",
    "summary": "Seeking Alpha 25d QQQ: This Chart Shows Market Still Underestimates Odds Of Hard Landing My last work on the Invesco QQQ Trust ETF (QQQ) was published about a month ago. To wit, on Jan 18, 2025, Seeking Alpha published an article of mine titled \"QQQ Vs. QQQM: You'll Be In For The Long ..."
  },
  {
    "title": "Nasdaq",
    "link": "/news/search?q=site%3awww.nasdaq.com&FORM=NWBCLM",
    "summary": "Nasdaq 1mon Should Invesco QQQ (QQQ) Be on Your Investing Radar? Companies that fall in the large cap category tend to have ... The top 10 holdings account for about 50.96% of total assets under management. QQQ seeks to match the performance of the NASDAQ ..."
  },
  {
    "title": "Nasdaq",
    "link": "/news/search?q=site%3awww.nasdaq.com&FORM=NWBCLM",
    "summary": "Nasdaq 10d QQQ March 2026 Options Begin Trading"
  },
  {
    "title": "Seeking Alpha",
    "link": "/news/search?q=site%3aseekingalpha.com&FORM=NWBCLM",
    "summary": "Seeking Alpha 25d QQQ: This Chart Shows Market Still Underestimates Odds Of Hard Landing"
  },
  {
    "title": "Nasdaq",
    "link": "/news/search?q=site%3awww.nasdaq.com&FORM=NWBCLM",
    "summary": "Nasdaq 1mon Should Invesco QQQ (QQQ) Be on Your Investing Radar?"
  }
]